tap "cmacrae/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "thoughtbot/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Command-line tool for DigitalOcean
brew "doctl"
# Dynamic window manager
brew "dwm"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Integer Set Library for the polyhedral model
brew "isl"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Platform built on V8 to build network applications
brew "node"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Rainbows and unicorns in your console!
brew "lolcat"
# Platform built on V8 to build network applications
brew "node@14"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Display the PID number for a given process name
brew "pidof"
# Object-relational database system
brew "postgresql", restart_service: true
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Terminal based presentation tool
brew "slides"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# A minimal status bar for macOS.
brew "cmacrae/formulae/spacebar"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Universal database tool and SQL client
cask "dbeaver-community"
# Tool to hide status bar icons
cask "dozer"
cask "font-fira-code"
# Icon set and toolkit
cask "font-fontawesome"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "java"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# Keyboard customizer
cask "karabiner-elements"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# MongoDB management tool
cask "robo-3t"
# Break time reminder app
cask "stretchly"
# Text editor for code, markup and prose
cask "sublime-text"
# To-do list and time tracker
cask "superproductivity"
# Open-source code editor
cask "visual-studio-code"
