tap "cmacrae/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "thoughtbot/formulae"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Diff that understands syntax
brew "difftastic"
# X.Org: X FreeType library
brew "libxft"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line tool for DigitalOcean
brew "doctl"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fully featured Firefox Send client
brew "ffsend"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Integer Set Library for the polyhedral model
brew "isl"
# GNU compiler collection
brew "gcc"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Platform built on V8 to build network applications
brew "node"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Rainbows and unicorns in your console!
brew "lolcat"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", link: false
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@14"
# Development kit for the Java programming language
brew "openjdk"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Display the PID number for a given process name
brew "pidof"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# Modern replacement for ps written by Rust
brew "procs"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Terminal based presentation tool
brew "slides"
# Zsh prompt for Astronauts
brew "spaceship"
# Spotify daemon
brew "spotifyd", restart_service: true
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# URL extractor/launcher
brew "urlview"
# Vi 'workalike' with many additional features
brew "vim"
# Pager/text based browser
brew "w3m"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A minimal status bar for macOS.
brew "cmacrae/formulae/spacebar"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Clipboard extension app
cask "clipy"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Screen color temperature controller
cask "flux"
# Icon set and toolkit
cask "font-fontawesome"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Keyboard customizer
cask "karabiner-elements"
# Open-source Markdown editor
cask "macdown"
# Timer application
cask "michaelvillar-timer"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# MongoDB management tool
cask "robo-3t"
# System monitor for the menu bar
cask "stats"
# Break time reminder app
cask "stretchly"
# Text editor for code, markup and prose
cask "sublime-text"
# To-do list
cask "todoist"
# Code editor
cask "visual-studio-code-insiders"
